/*Процентная ставка по вкладу составляет P процентов годовых, которые прибавляются к сумме вклада в конце года. Вклад составляет X рублей Y копеек. Определите размер вклада через год.
Программа должна вывести два числа: величину вклада через год в рублях и копейках. Дробная часть копеек отбрасывается.
*/
#include <iostream>
#include <math.h>

int main()
{
    int x = 0, y = 0;
    int p = 0;
    double sum = 0;
    scanf("%d %d %d", &p, &x, &y);
    sum = x * 100 + y;
    sum += sum * ((double)p / 100);
    sum = trunc(sum);
    x = sum / 100;
    y = sum - x * 100;
    printf("%d %d\n", x, y);
}