// Дан многочлен P(x)=anxn + an−1xn−1+ … + a1x + a0 и число x. Вычислите значение этого многочлена, воспользовавшись схемой Горнера
// Сначала программе подается на вход целое неотрицательное число n ≤ 20, затем действительное число x, затем следует n+1 вещественное число — коэффициенты многочлена от старшего к младшему
#include <iostream>

int main()
{
    int n = 0;
    double a = 0, p = 0, x = 0;
    scanf("%d %lf", &n, &x);

    for (int i = 0; i < n; ++i)
    {
        scanf("%lf", &a);
        p = (p + a) * x;
    }

    scanf("%lf", &a);
    p += a; // a_0

    printf("%g\n", p);
}