// Даны действительные коэффициенты a, b, c. Решите уравнение ax2 + bx + c = 0 и выведите все его корни
// Если данное уравнение не имеет корней, выведите число 0. Если уравнение имеет один корень, выведите число 1, а затем этот корень. Если уравнение имеет два корня, выведите число 2, а затем два корня в порядке возрастания. Если уравнение имеет бесконечно много корней, выведите число 3.
#include <iostream>
#include <math.h>

int main()
{
    double a = 0, b = 0, c = 0;
    scanf("%lf %lf %lf", &a, &b, &c);

    if (a == 0)
    {
        if (b == 0)
        {
            if (c == 0)
            {
                printf("3\n");
            }
            else
            {
                printf("0\n");
            }
        }
        else
        {
            printf("1 %g", -c / b);
        }
    }
    else
    {
        double d = b * b - 4 * a * c;

        if (d < 0)
        {
            printf("0\n");
        }
        else if (d == 0)
        {
            printf("1 %g\n", -b / (2 * a));
        }
        else if (d > 0)
        {
            double x1 = (-b + sqrt(d)) / (2 * a), x2 = (-b - sqrt(d)) / (2 * a);
            if (x1 < x2)
            {
                printf("2 %g %g\n", x1, x2);
            }
            else
            {
                printf("2 %g %g\n", x2, x1);
            }
        }
    }

    return 0;
}