// Даны вещественные числа a, b, c, d, e, f. Решите систему линейных уравнений
/*
Вывод программы зависит от вида решения этой системы.
Если система не имеет решений, то программа должна вывести единственное число 0.
Если система имеет бесконечно много решений, каждое из которых имеет вид y=kx+n, то программа должна вывести число 1, а затем значения k и n.
Если система имеет единственное решение (x0, y0), то программа должна вывести число 2, а затем значения x0 и y0.
Если система имеет бесконечно много решений вида x=x0, y — любое, то программа должна вывести число 3, а затем значение x0.
Если система имеет бесконечно много решений вида y=y0, x — любое, то программа должна вывести число 4, а затем значение y0.
Если любая пара чисел (x, y)  является решением, то программа должна вывести число 5.
*/
#include <iostream>
#include <math.h>

int main()
{
    double a = 0, b = 0, c = 0, d = 0, e = 0, f = 0;

    scanf("%lf %lf %lf %lf %lf %lf", &a, &b, &c, &d, &e, &f);

    if (a != 0)
    {
        if (b == 0)
        {
            if (d == 0)
            {
                if (c == 0)
                {
                    if (f == 0)
                    {
                        printf("3 %g\n", e / a); // x = e/a, y -- любое число
                    }
                    else // f != 0
                    {
                        printf("0\n"); // нет решений, тк 0 = не 0
                    }
                }
                else // c != 0
                {
                    if (f / c == e / a)
                    {
                        printf("3 %g\n", f / c); // x = f/c, y -- любое число
                    }
                    else // f/c != e/a
                    {
                        printf("0\n"); // нет решений, тк противоречие (x равен разным числам, кек)
                    }
                }
            }
            else // d != 0
            {
                if (c == 0)
                {
                    printf("2 %g %g\n", e / a, f / d);
                }
                else // c!=0
                {
                    printf("2 %g %g\n", e / a, (a * f - e * c) / (a * d));
                }
            }
        }
        else // b != 0
        {
            if (d == 0)
            {
                if (c == 0)
                {
                    if (f == 0)
                    {
                        printf("1 %g %g", -a / b, e / b); // прямая k = -a/b, n = e/b
                    }
                    else // f != 0
                    {
                        printf("0\n"); // нет решений, тк 0 = не 0
                    }
                }
                else // c != 0
                {
                    printf("2 %g %g\n", f / c, (e * c - a * f) / (c * b));
                }
            }
            else // d != 0
            {
                if (c == 0)
                {
                    printf("2 %g %g\n", (e * d - f * b) / (a * d), f / d);
                }
                else // c != 0
                {
                    if (a / c == b / d && (b / d == e / f) || (e == 0 && f == 0))
                    {
                        printf("1 %g %g\n", (-a) / b, e / b); // одна прямая получается
                    }
                    else if (a * d - b * c == 0 && b * c - a * d == 0)
                    {
                        printf("0\n");
                    }
                    else
                    {
                        printf("2 %g %g\n", (e * d - f * b) / (a * d - b * c), (e * c - a * f) / (b * c - a * d));
                    }
                }
            }
        }
    }
    else // a == 0
    {
        if (b == 0)
        {
            if (e != 0)
            {
                printf("0\n"); // нет решений, тк 0 = не 0
            }
            else // e == 0
            {
                if (d != 0)
                {
                    if (c == 0)
                    {
                        printf("4 %g\n", f / d);
                    }
                    else // c != 0
                    {
                        printf("1 %g %g\n", (-c) / d, f / d);
                    }
                }
                else // d == 0
                {
                    if (c == 0)
                    {
                        if (f == 0)
                        {
                            printf("5\n"); // x, y \in R
                        }
                        else // f!=0
                        {
                            printf("0\n"); // нет решений, тк 0 = не 0
                        }
                    }
                    else
                    {
                        printf("3 %g\n", f / c); // x = f/c, y \in R
                    }
                }
            }
        }
        else // b != 0
        {
            if (c == 0)
            {
                if (d == 0)
                {
                    if (f == 0)
                    {
                        printf("4 %g\n", e / b);
                    }
                    else // f != 0
                    {
                        printf("0\n"); // нет решений, тк 0 = не 0
                    }
                }
                else // d != 0
                {
                    if (f / d == e / b)
                    {
                        printf("4 %g\n", f / d);
                    }
                    else // f/d != e/b
                    {
                        printf("0\n");
                    }
                }
            }
            else // c != 0
            {
                if (d == 0)
                {
                    printf("2 %g %g\n", f / c, e / b);
                }
                else // d != 0
                {
                    printf("2 %g %g\n", (f * b - d * e) / (b * c), e / b);
                }
            }
        }
    }
}