# убрать из кучи 3 камня или 5 камней
# поделить количество камней нацело на 4 (это уже и будет округление вниз)


# петя не может выиграть за один ход, но при любом ходе пети ваня может выиграть своим первым ходом

S = 10

def game(s, h):

    win = (s - 3) <= S or (s-5) <= S or (s//4) <= S
    if h == 1 and win: # петин первый ход — он не может выиграть за 1 ход
        return 0
    if h == 2 and win:
        return 1
    if h > 2:
        return 0

    return game(s-3, h+1) * game(s-5, h+1) * game(s//4, h+1)


for s in range(11, 999):
    if game(s, 1):
        print(s)
