# убрать из кучи 3 камня или 5 камней
# поделить количество камней нацело на 4 (это уже и будет округление вниз)


# петя не может выиграть за один ход,
# петя всегда может выиграть своим вторым ходом
S = 10

def game(s, h):

    win = (s - 3) <= S or (s-5) <= S or (s//4) <= S
    if h == 1: # петин первый ход — он не может выиграть за 1 ход
        if win:
            return 0
        return game(s-3, h+1) + game(s-5, h+1) + game(s//4, h+1)

    if h == 3 and win: # петин второй ход
        return 1

    if h == 2 and win: # ВАНЯ НЕ МОЖЕТ ВЫИГРАТЬ, ИНАЧЕ ТРЕТЬЕГО ХОДА ПРОСТО НЕ БУДЕТ (забыл изначально)
        return 0

    if h > 3:
        return 0

    return game(s-3, h+1) * game(s-5, h+1) * game(s//4, h+1) # при любом ходе вани


for s in range(11, 999):
    if game(s, 1):
        print(s)
