// бассейн n*m. человек находится на расстоянии x метров от одного из длинных бортиков и y метров на расстоянии от одного из коротких бортиков. нужно определить кратчайшее расстояние до бортика
#include <iostream>
int main()
{
    int n = 0, m = 0, x = 0, y = 0, a = 0, b = 0;
    scanf("%d %d %d %d", &n, &m, &x, &y);

    // сделаем n короткой стороной (гарантированно), а m -- длинной
    if (n > m)
    {
        m = n + m;
        n = m - n;
        m = m - n;
    }

    // теперь сравним x и n-x, y и m-y
    a = n - x;
    b = m - y;

    // сравним x и y, выведем меньший
    int min1 = 0, min2 = 0;
    if (x > y)
    {
        min1 = y;
    }
    else
    {
        min1 = x;
    }

    if (a > b)
    {
        min2 = b;
    }
    else
    {
        min2 = a;
    }

    if (min1 < min2)
    {
        printf("%d\n", min1);
    }
    else
    {
        printf("%d\n", min2);
    }
    return 0;
}