/*
Элемент последовательности называется локальным максимумом, если он строго больше предыдущего и последующего элемента последовательности. Первый и последний элемент последовательности не являются локальными максимумами.

Дана последовательность натуральных чисел, завершающаяся числом 0. Определите количество строгих локальных максимумов в этой последовательности.
*/
#include <iostream>

int main()
{
    int i = 0, a = 0, b = 0, c = 0, counter = 0;
    scanf("%d", &i);
    c = i;

    while (i != 0)
    {
        a = b;
        b = i;
        scanf("%d", &i);
        c = i;

        if (b > a && b > c && a != 0 && c != 0)
        {
            ++counter;
        }
    }

    printf("%d\n", counter);
    return 0;
}