// Дано нечетное число n, не превосходящее 15. Создайте двумерный массив из n×n элементов, заполнив его символами "." (каждый элемент массива является строкой из одного символа). Затем заполните символами "*" среднюю строку массива, средний столбец массива, главную диагональ и побочную диагональ. В результате "*" в массиве должны образовывать изображение звездочки. Выведите полученный массив на экран, разделяя элементы массива пробелами.
#include <iostream>

int main()
{
    int n = 0;
    scanf("%d", &n);
    char a[n][n];
    for (int row = 0; row < n; ++row)
    {
        for (int column = 0; column < n; ++column)
        {
            if (row == n / 2 || column == n / 2 || row + column == n - 1 || row == column)
            {
                a[row][column] = '*';
            }
            else
            {
                a[row][column] = '.';
            }
        }
    }

    for (int row = 0; row < n; ++row)
    {
        for (int column = 0; column < n; ++column)
        {
            printf("%c ", a[row][column]);
        }
        printf("\n");
    }
}