/*
В небоскребе n этажей. Известно, что если уронить стеклянный шарик с этажа номер p, и шарик разобьется, то если уронить шарик с этажа номер p+1, то он тоже разобьется. Также известно, что при броске с последнего этажа шарик всегда разбивается.Вы хотите определить минимальный номер этажа, при падении с которого шарик разбивается. Для проведения экспериментов у вас есть два шарика. Вы можете разбить их все, но в результате вы должны абсолютно точно определить этот номер.
Определите, какого числа бросков достаточно, чтобы заведомо решить эту задачу.
*/

/*

решить


*/
#include <iostream>
#include <math.h>

int find_k(int n)
{
    int k = 1, sum = 0;
    for (int k = 0; k < n; ++k)
    {
        for (int i = 0; i < k; ++i)
        {
            sum += k - i;
        }

        if (sum >= n)
        {
            return k;
        }
        else
        {
            sum = 0;
        }
    }
    return 0;
}

int f(int n)
{
    if (n == 1)
    {
        return 0;
    }
    else if (n == 2)
    {
        return 1;
    }
    else
    {
        int k = find_k(n);

        // if (k - 1 > f(n - k + 1))
        //{
        //     return k;
        // }
        // else
        //{
        return 1 + f(n - k + 1);
        //   }
    }
}

int main()
{
    int n = 0;
    std::cin >> n;
    std::cout << f(n) << " with k = " << find_k(n) << std::endl;
}