# убрать из кучи 3 камня или 5 камней
# поделить количество камней нацело на 4 (это уже и будет округление вниз)



# ваня МОЖЕТ выиграть первым ИЛИ вторым ходом при любой игре пети (h = 2, h = 4)
# ваня НЕ МОЖЕТ гарантированно выиграть первым ходом (h = 2)
#
# сначала забиваем хуй на второе условие

S = 10
def vwins(s, h):
    win = (s - 3) <= S or (s-5) <= S or (s//4) <= S
    if h == 1: # ход пети не контроллируем
        if win: # петя выигрывает первым ходом — ваня не сможет выиграть своим первым
            return 0
        return vwins(s-3, h+1) * vwins(s-5, h+1) * vwins(s//4, h+1)
    if h == 2: # первый ход вани
        if win:
            return 1
        return 0
    if h > 3:
        return 0

def game(s, h):

    win = (s - 3) <= S or (s-5) <= S or (s//4) <= S

    if h % 2 == 1: # ходы пети (1 и 3), его ход мы не контроллируем
        if win:
            return 0
        return game(s-3, h+1) * game(s-5, h+1) * game(s//4, h+1)
    if h == 2:
        #if ((s-3) <= S) and ((s-5) <= S) and ((s//4) <= S): # гарантированный выигрыш вани
            # в тот раз мы с петей тут писали отдельную функцию, возможно это причина неправильного ответа сейчас
            #return 0
        if win: # выигрыш не гарантированный
            return 1
        return game(s-3, h+1) + game(s-5, h+1) + game(s//4, h+1)
    if h == 4:
       if win:
           return 1
       return 0
    if h > 4:
        return 0


for s in range(11, 999):
    if game(s, 1) and not(vwins(s,1)):
        print(s)
